/*Test 4 exercise*/
/*Taxi

Движението на "Е-такси" по много дълга улица е организирано така, че да има спирка на всеки километър. "Е-такси" се движи по улицата от всяка спирка и изминава 1, 2, ..., 10 километра без спиране. Цената за i км е ci,i=1,2,...,10.

Например:

c1=12, c2=21, c3=31, c3=40, c4=49, c5=58, c6=69, c7=79, c8=90, c9=101

Пътник иска да пътува  километра. Какви разстояния на пътуване трябва да избере, така, че пътуването да му излезе най-евтино, и каква е цената на цялото пътуване?

Input Format

За един тестов пример от стандартния вход се чете един ред, на който са записани 10 числа - цените за разстояния 1, 2, ..., 10 км и още едно число на същия ред - числото n.

Constraints

Всички числа от входа са положителни и по-малки от 1000.

Output Format

За всеки пример на стандартния изход се отпечатава едно число на отделен ред - цената на цялото пътуване.

Sample Input 0

12 21 31 40 49 58 69 79 90 101 15
Sample Output 0

147
*/
#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

int main() {
    vector<int> cost(10);
    int n;
    
    for (int i = 0; i < 10; i++) cin >> cost[i];
    cin >> n;

    vector<int> array(n + 1, 1e6);
    array[0] = 0;

    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= 10; j++) {
            if (i >= j) array[i] = min(array[i], array[i - j] + cost[j - 1]);
        }
    }

    cout << array[n] << endl;

    return 0;
}
